; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-91)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b22)
    (on b22 b8)
    (on-table b8)
    (clear b13)
    (on b13 b27)
    (on b27 b7)
    (on b7 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b18)
    (on b18 b3)
    (on b3 b15)
    (on b15 b14)
    (on b14 b25)
    (on-table b25)
    (clear b19)
    (on b19 b9)
    (on b9 b16)
    (on b16 b20)
    (on-table b20)
    (clear b11)
    (on b11 b26)
    (on b26 b1)
    (on b1 b24)
    (on b24 b12)
    (on b12 b4)
    (on b4 b10)
    (on b10 b6)
    (on b6 b21)
    (on b21 b23)
    (on-table b23))
 (:goal (and 
(on-table b20)
(on b16 b2)
))
)

; plan
1. (unstack b13 b27)
   deleted: (on b13 b27) (clear b13) (arm-empty)
   added: (holding b13) (clear b27)
   goals met: 1 of 2
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 2
3. (unstack b27 b7)
   deleted: (on b27 b7) (clear b27) (arm-empty)
   added: (holding b27) (clear b7)
   goals met: 1 of 2
4. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 1 of 2
5. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 1 of 2
6. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 2
7. (unstack b19 b9)
   deleted: (on b19 b9) (clear b19) (arm-empty)
   added: (holding b19) (clear b9)
   goals met: 1 of 2
8. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 2
9. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 1 of 2
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 2
11. (unstack b9 b16)
   deleted: (on b9 b16) (clear b9) (arm-empty)
   added: (holding b9) (clear b16)
   goals met: 1 of 2
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
13. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 1 of 2
14. (stack b16 b2)
   deleted: (clear b2) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b2)
   goals met: 2 of 2
